api/controllers/UserController.php

    public function actionIndex()
    {
        $users = User::find()->all();
---
SELECT * FROM `user`