frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `verification_token`, `status`, `role`, `created_at`, `updated_at`) VALUES ('admin', 'admin@gmail.com', '$2y$13$QZ3OZK.uctgtaYfzkpfRqOwGCLzRyC1AMp2IU..xA0aXaryTUwv4K', 'mOCbP3pOI4mNBAgNiyyaaVbTj5UQjkBE', 'wqQ3E_t1UoMp32PBUxjIvQlTON3mUJeO_1751206742', 10, 'admin', 1751206742, 1751206742)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();
        $user->status = User::STATUS_ACTIVE; // تجاوز التفعيل
        $user->role = $this->role; // أو مثلاً 'teacher' حسب الحالة

        // return $user->save() && $this->sendEmail($user);
        return $user->save();